<a href="https://colab.research.google.com/github/MUMADE-TADM/s1_python-NicolasTapiador/blob/main/TADM2022_S03b_Consultas_SQL_NICOL%C3%81S_TAPIADOR_SOBRINO.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Consultas SQL


Antes de empezar cargamos nuestro archivo data_berka en nuestro entorno: [enlace](https://sorry.vse.cz/~berka/challenge/pkdd1999/berka.htm)

In [ ]:
!gdown --id 1Osmr7qVN0NMuqYxvLesNn7H4nqPCVbsU

/usr/local/lib/python3.7/dist-packages/gdown/cli.py:131: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  category=FutureWarning,
Downloading...
From: https://drive.google.com/uc?id=1Osmr7qVN0NMuqYxvLesNn7H4nqPCVbsU
To: /content/data_berka.db
100% 70.2M/70.2M [00:01<00:00, 65.8MB/s]

En primer lugar cargamos la extensión que nos va permitir manejar comandos sql directamente en colab

In [ ]:
%load_ext sql

Y conectamos con la base de datos

In [ ]:
%sql sqlite:///data_berka.db

'Connected: @data_berka.db'

Comprobamos esquema

In [ ]:
%%sql
SELECT name,type
FROM sqlite_master
WHERE type = 'table'

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

## Consultas sobre Préstamos

1. Obtener todos los atributos que tiene el banco sobre sus prestamos.

(extra limitar a 20 registros)

In [ ]:
%%sql
SELECT *
FROM LOAN
LIMIT 20

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Esta sección de código está utlizando varias herramientas:
- **SELECT:** Al poner el *, le estamos indicando que nos seleccione todas las columnas.
- **FROM:** Indica de donde queremos que el SELECT coja todas las columnas, en este caso de LOAN(Prestamo
)
- **LIMIT:** Con esta función, estamos indicando que unicamente se limite a devolvernos un maximo de 20 resultados.

Entendido estas funciones, podemos realizar los siguientes ejercicios sin problema, hasta que aparezca una nueva función.

2. Obtener los campos de fecha (date), amount (cantidad), duración (duration), pagos (payments), estado (status)

(extra limitar a 20 registros)

In [ ]:
%%sql
SELECT date, amount, duration, payments, status
FROM LOAN
ORDER BY amount DESC
LIMIT 20

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

En este código, se introduce un nuevo elemento que es:
- **ORDER BY:** Estamos indicando que columna queremos que se ordene y en que sentido, en este caso es AMOUN y orden DESCENDENTE.

3. Obtener los distintos tipos de estado que se presentan en un préstamo.

In [ ]:
%%sql
SELECT DISTINCT  status
FROM  LOAN
ORDER BY status

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

4. Obtener solo los prestamos ya terminados.

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE status in ("A", "B")
LIMIT 100

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

En este codigo se está introduciendo una nueva función:
- **WHERE:** Aquí se le está aplicando a la busqueda una "CONDICIÓN" es decir, en nuestro ejemplo, se está aplicando la condición de aquellos prestamos que se encuentran en la situación A y B.

5. Ordenar lo anterior por duración y cantidad

extra: limitar a 20 elementos

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE status in ("A", "B")
ORDER BY duration, amount DESC
LIMIT 100

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Cargar el resultado de la sql en un DataFrame de Pandas.

In [ ]:
# IMPORTAR LIBRERIA.
import pandas as pd

# EJECUTAR SQL 
df = %sql SELECT * FROM LOAN WHERE status in ("A", "B") ORDER BY duration, amount 

# TRANSFORMAR EN DATAFRAME DE PANDAS.
df.DataFrame().to_csv("first_sql.csv")

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

AttributeError: ignored

Ex. 1

>Plantear otro filtro para los préstamos (por cantidad, duración, status, etc.)

In [ ]:
%%sql
SELECT *
FROM LOAN
WHERE duration 
ORDER BY amount DESC
LIMIT 25

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

 Ex. 2 

> Seleccionar fecha, cantidad, duración y pagos de aquellos préstamos que han sido terminados ordenados con una duración mayor de 12 meses de mayor a menor cantidad de dinero

>extra: volcar en un DataFrame

In [ ]:
%%sql
SELECT date, amount, duration, payments 
FROM LOAN
WHERE status in ("A", "B") AND duration > 12
ORDER BY  amount DESC

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

¿ Cuantos prestamos hay en ejecución (running) con duracion entre 24 y 48 meses ?

In [ ]:
%%sql
SELECT count(*)
FROM LOAN
WHERE status in ("C", "D") and duration between 24 and 48

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

## Group By

7. ¿Cuántos préstamos hay por cada estado y cual es la media de la cantidad de dinero prestado?

* where: se filtran los registros antes de agruparlos
* Having: Se filtran los grupos tras obtenerlos

In [ ]:
%%sql
SELECT status,  count(*) as total, avg (amount)
FROM LOAN
WHERE duration > 24
GROUP BY status
HAVING total > 25
ORDER BY total DESC

 * sqlite:///data_berka.db
Done.

[('C', 319, 195017.83072100315),
 ('A', 46, 163045.30434782608),
 ('D', 38, 277804.4210526316)]

En este código estamos realizando lo siguiente:

- **Se está seleccionando la variable Status, además, estamos pidiendo que nos cuente el total de prestamos por STATUS(Estado) y que nos seleccione la cantidad media del dinero prestado. Le estamos pidiendo que coja los datos de LOAN con la función FROM y le estableces la condición de durabilidad de menos de 24 meses.**

A partir de aquí, se introducen nuevas funciones, como son:

- GROUP BY : Nos proporciona una combinación de valores para mostrarlo en un unico registro, es decir, en este caso le estamos diciendo que los prestamos nos los agrupe en función de la variable STATUS o "Estado"

- HAVING: Es una función que puede complementar a GROUP BY ya que filtra los registros en función de la condición que le pongamos, es decir, basicamente un WHERE.

8. Por cada Región, quiero contar el número de ciudades y obtener el total del número de habitantes de la región

extra: no considerar la region de Praga.

In [ ]:
%%sql
SELECT A3, count(A2) no_districts, sum(A9) no_cities, sum(A4)
FROM DISTRICT
GROUP BY A3
HAVING no_districts > 1

 * sqlite:///data_berka.db
Done.

[('central Bohemia', 12, 66, 1105234),
 ('east Bohemia', 11, 86, 1234781),
 ('north Bohemia', 10, 70, 1178977),
 ('north Moravia', 11, 60, 1970302),
 ('south Bohemia', 8, 48, 700595),
 ('south Moravia', 14, 82, 2054989),
 ('west Bohemia', 10, 69, 859306)]

9. Contar ordenes permanentes (domiciliaciones) por banco y tipo de transacción

In [ ]:
%%sql
SELECT bank_to, k_symbol, count(*) as c
FROM PERMANENT_ORDER
WHERE amount < 400
GROUP BY bank_to, k_symbol
ORDER BY banl_to

# JOIN

10. ¿Cuántas cuentas de frecuencia mensual tienen un un préstamo activo?

In [ ]:
%%sql
SELECT loan_id, A4, A9, A10, A11, c.birth_number, l.date loan_date, amount, duration, payments, frequency, a.date acc_date, status
FROM LOAN l, ACCOUNT a, DISTRICT d, DISPOSITION dp, CLIENT c
WHERE l.account_id = a.account_id
AND a. district_id = d.A1
AND dp.account_id = a.account_id -- join account / disposition
AND status in ("A", "B")
ORDER BY amount DESC, a.date DESC
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(6228, 77963, 4, 51.5, 8546, '706213', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '450204', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '406009', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '561201', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '605703', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '190922', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '290125', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '385221', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '351016', 931201, 464520, 60, 7742, 'weekly', 930319, 'B'),
 (6228, 77963, 4, 51.5, 8546, '430501', 931201, 464520, 60, 7742, 'weekly', 930319, 'B')]

11. Domiciliaciones en cuentas de actualización semanal de alquiler en cuentas de Praga

In [ ]:
%%sql
SELECT order_id, p.account_id, amount
FROM PERMANENT_ORDER p, ACCOUNT a, DISTRICT d
WHERE p.account_id = a.account_id
and a.district_id = d.A1
and k_symbol = "LEASING"
and frequency = "weekly"
and A3 = "Prague"


12. Domiciliaciones (*órdenes*) semanales para alquiler (*leasing*) en cuentas de Praga

 - Ordenes permanentes de alquiler (*leasing*) y semanales (*weekly*)
 - Relación con cuentas que tienen región Praga

In [ ]:
%%sql
SELECT order_id, k_symbol, bank_to, a.account_id, a.frequency, d.A2, d.A3
FROM PERMANENT_ORDER p, ACCOUNT a, DISTRICT d
WHERE p.account_id = a.account_id and a.district_id = d.A1
    and k_symbol = "LEASING" and a.frequency = "weekly" and d.A3 = "Prague"

Este código devuelve lo siguiente:
- **Se están seleccionando las columnas marcadas por la función SELECT, que estas tengas los datos de las tablas que marcamos en FROM y que tengan las siguientes condiciones que nos marca WHERE**

13. Transacciones relacionadas con pensiones (DUCHOD) en Plzen desde el banco MN

(limitar a 10)

In [ ]:
%%sql
SELECT trans_id, a.account_id, a.frequency, t.type, k_symbol, bank
FROM TRANS t, ACCOUNT a, DISTRICT d
WHERE t.account_id = a.account_id and a.district_id = d.A1
  and k_symbol = "DUCHOD" and bank = "MN" and d.A2 like "Plzen%"  
LIMIT 10

# Subconsultas

14. Prestamos cuya cantidad es superior a la media de los clientes de Praga

- Cantidad media prestada a los cuentas de Praga

In [ ]:
%%sql
SELECT avg(l.amount)
FROM LOAN l, ACCOUNT a, DISTRICT D
WHERE l.account_id = a.account_id and a.district_id = d.A1 
and d.A3 = "Prague"

Aquí se están realizando funciones distintas, ya no se están realizando consultas, si no subconsultas, por tanto ciertos parametros cambian;

- **SELECT :** Le pedimos que nos devuelva la media prestada de l.amount.
- **FROM:** De donde queremos que obtenga los datos, es decir, de que tablas.
- **WHERE:** Le estamos marcando las condiciones, es decir, que una vez marcado de donde queremos que obtenga los datos, le condicionamos que sean unos datos especificos dentro de esas tablas seleccionadas.

- Consultar los préstamos superiores a esa cantidad

In [ ]:
%%sql
SELECT * FROM LOAN 
WHERE amount > (SELECT avg(l.amount)
        FROM LOAN l, ACCOUNT a, DISTRICT d
        WHERE l.account_id = a.account_id and a.district_id = d.A1  
        and d.A3 = "Prague")
ORDER BY amount DESC

# Repaso de Join/Group By

## Objetivo 2.1

15 . Clientes de Praga con préstamos según su estado

- ¿Cuántos clientes hay en Praga?
- ¿Cuántas cuentas tienen asociados clientes en Praga?
- ¿cuántas de esas cuentas tienen asociados un préstamo?
- Necesito saber cuántos hay por cada estado (*status*)

In [ ]:
%%sql 
SELECT status, count(*)
FROM CLIENT c, DISTRICT d, DISPOSITION dp, LOAN l 
WHERE c.district_id = d.A1 and c.client_id = dp.client_id
and l.account_id = dp.account_id and d.A3 = "Prague"
GROUP BY status

## Ejercicio

> cantidad de dinero medio en transacciones de clientes propietarios de cuentas en Kolin (owned accounts)

In [ ]:
%%sql
SELECT c.client_id, avg (amount) as av
from client c, district d, disposition ds, account a, trans t
WHERE c.district_id = d.A1 and c.client_id = ds.client_id
    and ds.account_id = a.account_id and a.account_id = t.account_id
and d.A2 = "Kolin" and ds.type = "OWNER" 
GROUP BY c.client_id
ORDER BY av DESC
LIMIT 10

 * sqlite:///data_berka.db
Done.

[(5249, 15611.831578947369),
 (3378, 14803.997402597402),
 (1388, 14464.587096774194),
 (6803, 13825.125153374232),
 (8091, 13227.722338204592),
 (3298, 13074.464857881138),
 (1806, 13037.759375),
 (4331, 12644.448051948051),
 (4974, 12023.291743119267),
 (3080, 11784.50460251046)]

> sanction interest if negative balance Cesky Krumlov


> stands for loan payment in Praha from the bank EF

# Extra: Left Join

1. ¿Cuántas cuentas hay? 4500
2. ¿Cuántas cuentas hay con préstamos? (inner join) 682
3. Cuentas con los datos de los préstamos si los hay
4. los ordenamos por cantidad

In [ ]:
%%sql 
SELECT a.account_id, a.date, l.amount, l.status, l.payments, l.duration
FROM ACCOUNT a INNER OUTER JOIN LOAN l ON a.account_id = l.account_id
ORDER BY amount DESC

 * sqlite:///data_berka.db
(sqlite3.OperationalError) unknown or unsupported join type: INNER OUTER
[SQL: SELECT a.account_id, a.date, l.amount, l.status, l.payments, l.duration
FROM ACCOUNT a INNER OUTER JOIN LOAN l ON a.account_id = l.account_id
ORDER BY amount DESC]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

# DataSets

---

Dataset sobre las transacciones con Vyskov, extrayendo los años de las diferentes fechas.

In [ ]:
%%sql dataset << SELECT substr(a.date,0,3) acc_year, substr(t.date, 0, 3) year,amount, balance, k_symbol
FROM ACCOUNT a, TRANS t, DISTRICT d
WHERE a.district_id = d.A1 and d.A2 = "Vyskov"
AND a.account_id = t.account_id

 * sqlite:///data_berka.db
Done.
Returning data to local variable dataset

In [ ]:
dataset.DataFrame().to_csv("dataset.csv")